# K-Nearest Neighbors KNN

## Finalidade do notebook ##

Escrever testes e possíveis anotações importantes sobre o uso de KNN com scikit-learn e pandas.

In [14]:
# Definindo e limpando dataset
import pandas as pd
import numpy as np

cols = ['user_id', 'movie_id', 'stars']
df = pd.read_csv("./Dataset-Curso/u.data", sep='\t', names=cols, usecols=range(3))

df.head()

   user_id  movie_id  stars
0        0        50      5
1        0       172      5
2        0       133      1
3      196       242      3
4      186       302      3

Fazendo uma análise rápida do dataset é possível perceber que as notas vão de 0 a 5, deixando uma margem baixa para cálculos muito distantes.

In [15]:
notas = df.groupby('movie_id').agg({'stars': [np.size, np.mean]})
notas.head()

/tmp/ipykernel_13859/4252825799.py:1: FutureWarning: The provided callable <function mean at 0x78b751b8b060> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  notas = df.groupby('movie_id').agg({'stars': [np.size, np.mean]})

         stars
          size      mean
movie_id
1          452  3.878319
2          131  3.206107
3           90  3.033333
4          209  3.550239
5           86  3.302326

In [17]:
movie_ratings = pd.DataFrame(notas['stars']['size'])
movie_ratings_normalized = movie_ratings.apply(lambda x: (x - np.min(x)) / (np.max(x) - np.min(x)))
movie_ratings_normalized.head()

              size
movie_id
1         0.773585
2         0.222985
3         0.152659
4         0.356775
5         0.145798

In [28]:
movie_dict = {}

with open (r'./Dataset-Curso/u.item', encoding='ISO-8859-1') as f:
    temp = ''
    for line in f:
        fields = line.rstrip('\n').split('|')
        movieId = int(fields[0])
        name = fields[1]
        genre = fields[5:25]
        genre = map(int, genre)
        movie_dict[movieId] = (name, genre, movie_ratings_normalized.loc[movieId].get('size'), notas.loc[movieId].stars.get('size'))

In [29]:
movie_dict[1]

('Toy Story (1995)',
 <map at 0x78b7249372b0>,
 np.float64(0.7735849056603774),
 np.float64(452.0))